# CEBW-YOLO11 模型配置文件
# 基于YOLO11n，集成四个改进模块
nc: 4  # 缺陷类别数：Agglomeration, Bubble, Crack, Scratch
scales:
  n: [0.33, 0.25, 1024]  # depth, width, max_channels

backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C3k2, [128, True]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C3k2_DWR, [256, True]]  # 4 —— 替换为C3k2-DWR
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C3k2, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C3k2, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]]   # 9
  - [-1, 1, C2PSA_EAC, [1024, 4]]  # 10 —— EAC替换C2PSA的FFN

neck:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 上采样
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C3k2, [512, False]]  # 11

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C3k2, [256, False]]  # 12 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C3k2, [512, False]]  # 13 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C3k2, [1024, False]] # 14 (P5/32-large)

  # BiFPN-DySample 多尺度融合（num_repeats=3）
  - [[12, 13, 14], 1, BiFPNDySampleModule, [[256, 512, 1024], 3, 4]]

head:
  - [[15, 16, 17], 1, Detect, [nc]]  # 最终检测输出