# cebw_yolo11.yaml (仅展示修改部分)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]      # 0
  - [-1, 1, Conv, [128, 3, 2]]     # 1
  - [-1, 3, C3k2, [128, True]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]     # 3
  - [-1, 6, C3k2_DWR, [256, True]] # 4  ← 替换为C3k2-DWR
  - [-1, 1, Conv, [512, 3, 2]]     # 5
  - [-1, 6, C3k2, [512, True]]     # 6
  - [-1, 1, Conv, [1024, 3, 2]]    # 7
  - [-1, 3, C3k2, [1024, True]]    # 8
  - [-1, 1, SPPF, [1024, 5]]       # 9
  - [-1, 1, C2PSA_EAC, [1024, 4]]  # 10 ← 替换FFN为EAC

neck:
  # ... 省略原始上采样等 ...
  # 最后接入BiFPNDySampleModule
  - [[-1, 6, 4], 1, BiFPNDySampleModule, [[256, 512, 1024], 3, 4]]  # 假设索引需要调整
head:
  - [[...], 1, Detect, [nc]]